In [13]:
import pandas as pd

In [14]:
emissions_data = pd.read_csv('../data/processed/global_emissions.csv')
emissions_data.head()

   year      country       sector  emissions
0  1970  Afghanistan  Agriculture   0.029229
1  1970      Albania  Agriculture   0.113300
2  1970    Argentina  Agriculture   0.104343
3  1970      Armenia  Agriculture   0.055288
4  1970    Australia  Agriculture   0.311143

In [15]:
uk_emissions = emissions_data[emissions_data['country'] == 'United Kingdom'].groupby('year')['emissions'].sum().reset_index()
uk_emissions.columns = ['year', 'total_emissions']

uk_emissions.head()

   year  total_emissions
0  1970       673.420150
1  1971       668.671393
2  1972       657.717153
3  1973       690.030990
4  1974       644.640190